{
  "strategy_overview": {
    "name": "Intraday Liquidity & Volatility Model",
    "built_for": {
      "instruments": ["Futures", "Forex"],
      "trading_style": ["Swing Trading", "Day Trading"]
    },
    "description": "This strategy focuses on how price reacts to liquidity and volatility during the trading day. Liquidity refers to the areas on a chart where other traders have placed stop-loss orders, usually just above recent highs or just below recent lows. The market often moves into these areas to trigger those stops and then either reverses sharply or continues strongly in the same direction.",
    "objective": "The goal of this strategy is to spot those liquidity grabs, wait for a clear reaction, and then enter with confidence, either to trade the reversal or the continuation. The method is built for traders who prefer to focus on one trading day at a time, using clear logic, session structure, and precise timing.",
    "execution_flow": "Each trade begins with a daily bias, a simple outlook on whether price is likely to move up or down today. Then the trader watches for session liquidity raids (like the Asian or London session highs/lows being taken out), and enters only after confirmation appears through a fair value gap, market structure shift, or divergence between markets.",
    "applicability": "This model works well for intraday trades but can also be used for swing trades when the higher time frame aligns with the setup."
  },
  "playbook_rules": {
    "prerequisites": "To take a trade using this model, the following must be true:",
    "rules": [
      {
        "rule": "Clear Daily Bias",
        "description": "Decide if you're bullish or bearish for the day using the daily chart. Consider recent highs, lows, inefficiencies, and where the price is likely to go next."
      },
      {
        "rule": "Session Liquidity Zones Marked",
        "description": "These are common stop zones and entry traps.",
        "zones": [
          "Previous Day's High and Low",
          "Asian Session High/Low",
          "London Session High/Low"
        ]
      },
      {
        "rule": "Wait for a Liquidity Raid",
        "description": "A key session level must be taken out during the New York session, this is your signal that stop orders have been hit and a potential move is beginning."
      },
      {
        "rule": "Confirmation on Lower Time Frame (15m / 5m)",
        "description": "After the liquidity raid, wait for one of these confirmations:",
        "confirmations": [
          "Fair Value Gap (FVG)",
          "Market Structure Shift (MSS)",
          "Turtle Soup (false breakout and reversal)",
          "Breaker Block"
        ]
      },
      {
        "rule": "Ideal Time Window",
        "description": "Trade setups should form between 9:30 and 11:30 AM EST."
      },
      {
        "rule": "Target & Exit",
        "description": "Your target depends on the setup type:",
        "targets": {
          "intraday": "Opposite session liquidity, fair value gaps, or equal highs/lows. If the trade slows near midday, consider exiting even before the full target is reached.",
          "swing": "Use higher time frame liquidity zones (daily/weekly highs or lows), imbalances, or major structure. Swing trades can be held for multiple days as long as the bias and structure support it."
        },
        "guidance": "Use time-of-day awareness, price behavior, and your risk profile to decide whether to hold or exit early."
      }
    ]
  },
  "strategy_evaluation": {
    "title": "Pros and Cons of the Strategy",
    "introduction": "This model is designed to deliver high-quality, repeatable setups, but like any trading method, there are key things to understand before using it.",
    "note": "Note: The cons listed here aren't disadvantages. They are things to be aware of — important characteristics that require patience, discipline, and proper management to make the model work effectively.",
    "pros": [
      "Simple and Repeatable: Focuses on clear setups around session liquidity and timing.",
      "Based on Real Market Mechanics: Follows how institutional traders seek out stops.",
      "Works Across Assets: Can be applied to futures, forex, and even crypto with slight adjustments.",
      "Time Efficient: Trades typically form during defined hours (9:30–11:30 AM EST).",
      "Scalable: Can be used for intraday or swing trades depending on market context."
    ],
    "cons": [
      "Requires Patience: Must wait for specific conditions to be met (liquidity sweep + confirmation).",
      "Some Discretion Needed: Not fully mechanical; confirmation often relies on judgment.",
      "Time-Sensitive: Works best when you can monitor the market during active sessions.",
      "Data Collection is Key: Building confidence in the model requires tracking outcomes and journaling.",
      "Early/Midday Exits Can Be Challenging: Knowing when to take partials or exit early takes practice."
    ]
  },
  "trade_examples": [
    {
      "name": "NQ Short (15-Min Chart)",
      "scenario": "Bearish intraday trade on Nasdaq 100 Futures",
      "breakdown": [
        {
          "step": "Bearish Bias",
          "description": "The market was in a short-term downtrend. The bias for the day was bearish, expecting the price to move lower."
        },
        {
          "step": "Mark Key Levels",
          "description": "The Previous Day's High (PDH) was marked as potential buy-side liquidity. Asian Session Low is still untouched — this became the downside target (sell-side liquidity)."
        },
        {
          "step": "PDH Gets Taken (Liquidity Grab)",
          "description": "During the session, the price pushed above the PDH. This move swept out stop-losses from short traders and pulled in breakout buyers. The breakout failed to continue, a sign that the move was a liquidity raid, not real strength."
        },
        {
          "step": "Two Entry Opportunities",
          "opportunities": [
            {
              "entry": "First Entry",
              "description": "Entered short immediately after the PDH was taken, and the price failed to continue higher. A stop is placed just above the sweep high."
            },
            {
              "entry": "Second Entry",
              "description": "If you didn't catch the initial short right after the PDH was taken, a second opportunity came shortly after. Price dropped, then formed a 15-minute Fair Value Gap (FVG). The price was retraced into the FVG and rejected. This offered a second chance to enter short, again with a stop above the high."
            }
          ]
        },
        {
          "step": "Exit Around Midday",
          "description": "Price moved lower, reached the Asian session low around 12:15 PM EST, and the trade was closed. This matched the intraday low timing and avoided afternoon chop."
        }
      ]
    },
    {
      "name": "NQ Short from 1H Fair Value Gap",
      "scenario": "Swing-type setup using a 1-hour confirmation",
      "breakdown": [
        {
          "step": "Daily Bias",
          "description": "Bearish"
        },
        {
          "step": "Mark the Asian Session High",
          "description": "Before the New York session, the Asian session high was marked as a potential liquidity level. This area often holds stop orders from traders who went short early or breakout buyers waiting to enter."
        },
        {
          "step": "Asian High Gets Taken",
          "description": "At the start of the session, price pushed up and swept the Asian session high. This move triggered stops and drew in breakout buyers, but the push lacked follow-through and quickly stalled."
        },
        {
          "step": "Entry from the 1-Hour Fair Value Gap",
          "description": "After the sweep, price formed a clean 1-hour bearish Fair Value Gap (FVG). Price returned to the FVG, failed to push higher, and showed clear rejection.",
          "execution": {
            "entry": "Inside the 1H FVG",
            "stop": "Above the high of the sweep",
            "target": "Sell-side liquidity near recent lows"
          }
        },
        {
          "step": "Strong Continuation",
          "description": "Price dropped sharply after rejecting the FVG, delivering a fast move to the downside and hitting the target within the session."
        }
      ]
    }
  ]
}