{
  "Stock": "A share in a corporation that can be traded on a stock exchange.",
  "All-Time High": "The highest price ever reached by a security or index.",
  "Bond": "A debt agreement in which the issuer raises capital and promises interest payments and repayment of principal.",
  "Ask": "The price at which a seller is willing to sell a security.",
  "Premium": "The amount by which the price of an option exceeds its intrinsic value.",
  "Breakout": "The price moving above resistance or below support, possibly indicating a trend change.",
  "Bear Market": "A phase of falling prices and pessimistic market sentiment.",
  "Underlying Asset": "The asset on which a derivative is based, such as a stock or index.",
  "Benchmark": "A standard, such as an index, used to measure the performance of a security or fund.",
  "Bid": "The price at which a buyer is willing to purchase a security.",
  "Black-Scholes Model": "A mathematical model used to value options.",
  "Bollinger Bands": "A technical indicator measuring volatility using bands around a moving average.",
  "Candlestick": "A price chart representation showing open, close, high, and low prices.",
  "Clearing": "The process of settling and reconciling securities transactions.",
  "CFD": "Contract for Difference; a derivative allowing speculation on price movements without owning the asset.",
  "Commodity": "A raw material such as gold, oil, or wheat.",
  "Call Option": "A contract giving the right, but not the obligation, to buy a security at a set price.",
  "Chart Analysis": "The study of historical price movements to forecast future trends.",
  "DAX": "The German stock index representing major publicly traded companies.",
  "Day Trading": "Buying and selling securities within the same trading day.",
  "Brokerage Account": "An account used to hold securities and financial instruments.",
  "Dividend": "A profit distribution paid by a company to its shareholders.",
  "Diversification": "Spreading investments across assets to reduce risk.",
  "Dow Jones": "A U.S. stock index tracking 30 major industrial companies.",
  "Elliott Wave Theory": "A technical analysis method based on recurring wave patterns.",
  "Issuer": "An institution or company that issues securities.",
  "ETF": "Exchange Traded Fund; a fund traded on an exchange tracking an index or strategy.",
  "Eurex": "One of the world's largest derivatives exchanges.",
  "Euronext": "A pan-European stock exchange operator.",
  "Issue Price": "The price at which new securities are first sold to investors.",
  "Future": "A standardized contract to buy or sell an asset at a future date and price.",
  "Fundamental Analysis": "Evaluating a security using financial and economic data.",
  "Federal Reserve": "The central banking system of the United States.",
  "FOMC": "The Federal Open Market Committee, responsible for U.S. monetary policy decisions.",
  "Forward Contract": "A customized agreement to buy or sell an asset in the future.",
  "Fundamental Investors": "Investors who base decisions on economic and financial fundamentals.",
  "Gap": "A price gap between two trading periods.",
  "Bid Price": "The price a buyer is willing to pay.",
  "Trading Volume": "The number of securities traded during a specific period.",
  "Hedging": "A strategy used to reduce risk by offsetting positions.",
  "High-Frequency Trading": "Algorithmic trading executed at extremely high speeds.",
  "Inflation": "A sustained increase in the general price level of goods and services.",
  "Index": "A measurement of the performance of a market or group of securities.",
  "Intraday Trading": "Trading that occurs within a single trading day.",
  "IPO": "Initial Public Offering; the first public sale of a company's shares.",
  "Limit Order": "An order to buy or sell a security at a specified price or better.",
  "Long Position": "Buying a security with the expectation that its price will rise.",
  "Short Selling": "Selling borrowed securities hoping to repurchase them at a lower price.",
  "Junk Bond": "A high-yield bond with low credit quality and higher risk.",
  "Capital Market": "The market for long-term financial instruments.",
  "Knock-Out Certificate": "A derivative that expires worthless if a certain price level is reached.",
  "P/E Ratio": "Price-to-Earnings ratio used to value a stock.",
  "Correlation": "A statistical measure of the relationship between variables.",
  "Liquidity": "The ability to quickly buy or sell an asset without affecting its price.",
  "Short Interest Ratio": "The percentage of shares sold short.",
  "Long-Term Investment": "An investment strategy focused on long-term growth.",
  "Margin": "Collateral required to open leveraged positions.",
  "Market Maker": "An entity providing continuous buy and sell prices.",
  "Moving Average": "An indicator that smooths price data to identify trends.",
  "Market Order": "An order to buy or sell at the current market price.",
  "NASDAQ": "A U.S. electronic stock exchange focused on technology companies.",
  "Nominal Value": "The face value of a financial instrument.",
  "Order Book": "A list of buy and sell orders for a security.",
  "Option": "A contract giving the right to buy or sell an asset.",
  "OTC": "Over-the-counter trading outside regulated exchanges.",
  "Pips": "The smallest price movement in forex trading.",
  "Put Option": "A contract giving the right to sell a security at a set price.",
  "Portfolio": "The total collection of an investor’s assets.",
  "Primary Market": "The market where new securities are issued.",
  "Quote": "The stated price to buy or sell a security.",
  "Quantitative Easing": "A monetary policy where central banks increase money supply.",
  "Return": "The profit or loss generated by an investment.",
  "Resistance": "A price level where selling pressure increases.",
  "Risk Management": "The process of identifying and controlling investment risks.",
  "Spread": "The difference between bid and ask prices.",
  "Stop-Loss Order": "An order designed to limit losses.",
  "Support": "A price level where buying pressure increases.",
  "Swing Trading": "A strategy holding positions for days or weeks.",
  "Take-Profit Order": "An order that locks in profits at a predetermined price.",
  "Technical Analysis": "Market analysis based on price and volume data.",
  "Ticker Symbol": "A unique code identifying a security on an exchange.",
  "Trend": "The general direction of price movement.",
  "Underlying": "The asset on which a derivative is based.",
  "Volatility": "The degree of price fluctuation over time.",
  "Value Investing": "An investment strategy focused on undervalued securities.",
  "Security": "A tradable financial instrument.",
  "Resistance Level": "A price point that limits upward movement.",
  "Currency Risk": "The risk of loss due to exchange rate changes.",
  "Xetra": "An electronic trading system operated by Deutsche Börse.",
  "Yield": "The income return on an investment.",
  "Yield Curve": "A graph showing bond yields across different maturities.",
  "Central Bank": "An institution responsible for monetary policy.",
  "Certificate": "A structured financial product.",
  "Interest Rates": "The cost of borrowing or the return on lending money.",
  "Futures Market": "A market for standardized forward contracts."
}